app/controllers/api/v1/links_controller.rb

  def update
    @link = Link.find(params[:id])
    if @link.update(link_params)
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "links" SET "read" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["read", true], ["updated_at", 2016-10-31 23:41:19 UTC], ["id", 2]]