app/controllers/links_controller.rb

INSERT INTO "links" ("url", "title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["url", "realgm.com"], ["title", "knicks"], ["created_at", 2016-10-31 18:34:19 UTC], ["updated_at", 2016-10-31 18:34:19 UTC], ["user_id", 3]]
---
  def create
    parsed_link = Parser.new(link_params[:url])
    link = current_user.links.new(url: parsed_link.url , title: link_params[:title])
    if link.save && parsed_link.should_be_emailed?

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "links" SET "title" = $1, "url" = $2, "updated_at" = $3 WHERE "links"."id" = $4  [["title", "better"], ["url", "http://gooooogle.com"], ["updated_at", 2016-11-01 01:17:41 UTC], ["id", 36]]
---
  def update
    @link = Link.find(params[:id])
    parsed_link = Parser.new(link_params[:url])
    if @link.update(url: parsed_link.url, title: link_params[:title])